In [72]:
import pandas as pd
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data)
df

    name  reports  year
0  Jason        4  2012
1  Molly       24  2012
2   Tina       31  2013
3   Jake        2  2014
4    Amy        3  2014

In [78]:
#df.drop([1,4], axis=0, inplace=True)
x = pd.Series([100])
x.bool()

ValueError: bool cannot act on a non-boolean single element Series

In [74]:
 for i in (0,3):
    if df.loc[i] == df.loc[i+1] :
        print('raissa')

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [48]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df

    name  reports  year
2  Molly       24  2012
3   Tina       31  2013
4   Jake        2  2014
5    Amy        3  2014

In [22]:
df.drop(0, axis=0)

    name  reports  year
1  Molly       24  2012
2   Tina       31  2013
3   Jake        2  2014
4    Amy        3  2014

In [23]:
df=df[df.reports != 31]

In [24]:
rais=df.reports==24

In [28]:
df.index

Int64Index([0, 1, 3, 4], dtype='int64')

In [26]:
al=df.reports[rais].index[0]

In [27]:
df.drop(al, axis=0)

    name  reports  year
0  Jason        4  2012
3   Jake        2  2014
4    Amy        3  2014